## 1.Import library

In [120]:
import pandas as pd

## 2.Read CSV

### 2.1. Film CSV

In [121]:
df_film=pd.read_csv('./csv/film.csv')

In [122]:
df_film.shape

(1002, 14)

In [123]:
df_film.head(5)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,1,NaN,6,0.99,86.0,20.99,PG,2007-09-10 17:46:03.905795,"{""Deleted Scenes"",""Behind the Scenes""}",'academi':1 'battl':15 'canadian':20 'dinosaur...
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006.0,1,NaN,3,4.99,48.0,12.99,G,2007-09-10 17:46:03.905795,"{Trailers,""Deleted Scenes""}",'ace':1 'administr':9 'ancient':19 'astound':4...
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006.0,1,NaN,7,2.99,50.0,18.99,NC-17,2007-09-10 17:46:03.905795,"{Trailers,""Deleted Scenes""}",'adapt':1 'astound':4 'baloon':19 'car':11 'fa...
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006.0,1,NaN,5,2.99,117.0,26.99,G,2007-09-10 17:46:03.905795,"{Commentaries,""Behind the Scenes""}",'affair':1 'chase':14 'documentari':5 'fanci':...
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006.0,1,NaN,6,2.99,130.0,22.99,G,2007-09-10 17:46:03.905795,"{""Deleted Scenes""}",'african':1 'chef':11 'dentist':14 'documentar...

### 2.2.Film category CSV

In [124]:
df_film_category=pd.read_csv("./csv/film_category.csv")

In [125]:
df_film_category.shape

(1000, 3)

In [126]:
df_film_category.head(5)

   film_id  category_id          last_update
0        1            6  2006-02-15 10:07:09
1        2           11  2006-02-15 10:07:09
2        3            6  2006-02-15 10:07:09
3        4           11  2006-02-15 10:07:09
4        5            8  2006-02-15 10:07:09

### 2.3 Category CSV

In [127]:
df_category=pd.read_csv("./csv/category.csv")

In [128]:
df_category.shape

(16, 3)

In [129]:
df_category.head(5)

   category_id       name          last_update
0            1     Action  2006-02-15 09:46:27
1            2  Animation  2006-02-15 09:46:27
2            3   Children  2006-02-15 09:46:27
3            4   Classics  2006-02-15 09:46:27
4            5     Comedy  2006-02-15 09:46:27

### 2.4.Inventory CSV

In [130]:
df_inventory=pd.read_csv('./csv/inventory.csv')

In [131]:
df_inventory.shape

(4581, 4)

In [132]:
df_inventory.head(5)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 10:09:17
1             2        1         1  2006-02-15 10:09:17
2             3        1         1  2006-02-15 10:09:17
3             4        1         1  2006-02-15 10:09:17
4             5        1         2  2006-02-15 10:09:17

### 2.5 Language CSV

In [133]:
df_language=pd.read_csv("./csv/language.csv")

In [134]:
df_language.head(5)

   language_id                  name          last_update
0            1  English               2006-02-15 10:02:19
1            2  Italian               2006-02-15 10:02:19
2            3  Japanese              2006-02-15 10:02:19
3            4  Mandarin              2006-02-15 10:02:19
4            5  French                2006-02-15 10:02:19

In [135]:
df_language.shape

(6, 3)

### 2.6 dimDate.csv

In [136]:
df_DimDate=pd.read_csv("dimDate.csv")

In [137]:
df_DimDate.shape

(2191, 23)

In [138]:
df_DimDate.head(5)

,orderdate_key,full date,day of week,day num in month,day num overall,day name,day abbrev,weekday flag,week num in year,week num overall,...,month num overall,month name,month abbrev,quarter,year,yearmo,fiscal month,fiscal quarter,fiscal year,month end flag
0,19960101,1/1/1996,1,1,1,Monday,Mon,Y,1,1,...,1,January,Jan,1,1996,199601,7,3,1996,N
1,19960102,1/2/1996,2,2,2,Tuesday,Tue,Y,1,1,...,1,January,Jan,1,1996,199601,7,3,1996,N
2,19960103,1/3/1996,3,3,3,Wednesday,Wed,Y,1,1,...,1,January,Jan,1,1996,199601,7,3,1996,N
3,19960104,1/4/1996,4,4,4,Thursday,Thu,Y,1,1,...,1,January,Jan,1,1996,199601,7,3,1996,N
4,19960105,1/5/1996,5,5,5,Friday,Fri,Y,1,1,...,1,January,Jan,1,1996,199601,7,3,1996,N

## 3.Integrated

 ### 3.1.Join the film table with the film category table with the category table

In [139]:
merged_film_film_category = pd.merge(df_film, df_film_category, on='film_id',how='inner')

In [140]:
df_final_film=pd.merge(merged_film_film_category,df_category,on='category_id',how='inner')

In [141]:
df_final_film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'last_update_x', 'special_features',
       'fulltext', 'category_id', 'last_update_y', 'name', 'last_update'],
      dtype='object')

In [142]:
df_final_film.head(5)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update_x,special_features,fulltext,category_id,last_update_y,name,last_update
0,1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,1,NaN,6,0.99,86.0,20.99,PG,2007-09-10 17:46:03.905795,"{""Deleted Scenes"",""Behind the Scenes""}",'academi':1 'battl':15 'canadian':20 'dinosaur...,6,2006-02-15 10:07:09,Documentary,2006-02-15 09:46:27
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006.0,1,NaN,3,4.99,48.0,12.99,G,2007-09-10 17:46:03.905795,"{Trailers,""Deleted Scenes""}",'ace':1 'administr':9 'ancient':19 'astound':4...,11,2006-02-15 10:07:09,Horror,2006-02-15 09:46:27
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006.0,1,NaN,7,2.99,50.0,18.99,NC-17,2007-09-10 17:46:03.905795,"{Trailers,""Deleted Scenes""}",'adapt':1 'astound':4 'baloon':19 'car':11 'fa...,6,2006-02-15 10:07:09,Documentary,2006-02-15 09:46:27
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006.0,1,NaN,5,2.99,117.0,26.99,G,2007-09-10 17:46:03.905795,"{Commentaries,""Behind the Scenes""}",'affair':1 'chase':14 'documentari':5 'fanci':...,11,2006-02-15 10:07:09,Horror,2006-02-15 09:46:27
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006.0,1,NaN,6,2.99,130.0,22.99,G,2007-09-10 17:46:03.905795,"{""Deleted Scenes""}",'african':1 'chef':11 'dentist':14 'documentar...,8,2006-02-15 10:07:09,Family,2006-02-15 09:46:27

> Remove some unnecessary attributes

In [143]:
list_remove=['category_id','last_update_y','last_update_x','last_update','fulltext','original_language_id']
df_final_film.drop(list_remove, axis=1, inplace=True)

In [144]:
df_final_film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'name'],
      dtype='object')

>rename a few attributes

In [145]:
df_final_film = df_final_film.rename(columns={'name': 'catalogy name'})

In [146]:
df_final_film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'catalogy name'],
      dtype='object')

### 3.2 Join the final film table with the language table

In [147]:
df_final_language=pd.merge(df_language,df_final_film,on='language_id',how='inner')

In [148]:
df_final_language.columns

Index(['language_id', 'name', 'last_update', 'film_id', 'title', 'description',
       'release_year', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'catalogy name'],
      dtype='object')

In [149]:
df_final_language.head(5)

,language_id,name,last_update,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,catalogy name
0,1,English,2006-02-15 10:02:19,1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary
1,1,English,2006-02-15 10:02:19,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006.0,3,4.99,48.0,12.99,G,"{Trailers,""Deleted Scenes""}",Horror
2,1,English,2006-02-15 10:02:19,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006.0,7,2.99,50.0,18.99,NC-17,"{Trailers,""Deleted Scenes""}",Documentary
3,1,English,2006-02-15 10:02:19,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006.0,5,2.99,117.0,26.99,G,"{Commentaries,""Behind the Scenes""}",Horror
4,1,English,2006-02-15 10:02:19,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006.0,6,2.99,130.0,22.99,G,"{""Deleted Scenes""}",Family

> Remove some unnecessary attributes

In [150]:
list_remove_features=['language_id','last_update']
df_final_language.drop(list_remove_features, axis=1, inplace=True)

In [151]:
df_final_language.columns

Index(['name', 'film_id', 'title', 'description', 'release_year',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'catalogy name'],
      dtype='object')

> rename a few attributes

In [152]:
df_final_language = df_final_language.rename(columns={'name': 'language'})

In [153]:
df_final_language.columns

Index(['language', 'film_id', 'title', 'description', 'release_year',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'catalogy name'],
      dtype='object')

> format the attribute order

In [154]:
df_final_language=df_final_language[['film_id', 'title', 'description', 'release_year','language',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'catalogy name']]

In [155]:
df_final_language.columns

Index(['film_id', 'title', 'description', 'release_year', 'language',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'catalogy name'],
      dtype='object')

### 3.3.Join the final language table with the inventory table

In [156]:
df_diminventory=pd.merge(df_final_language,df_inventory,on='film_id',how='inner')

In [157]:
df_diminventory.columns

Index(['film_id', 'title', 'description', 'release_year', 'language',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'catalogy name', 'inventory_id',
       'store_id', 'last_update'],
      dtype='object')

In [158]:
df_diminventory.head(5)

,film_id,title,description,release_year,language,rental_duration,rental_rate,length,replacement_cost,rating,special_features,catalogy name,inventory_id,store_id,last_update
0,1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,1,1,2006-02-15 10:09:17
1,1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,2,1,2006-02-15 10:09:17
2,1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,3,1,2006-02-15 10:09:17
3,1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,4,1,2006-02-15 10:09:17
4,1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,5,2,2006-02-15 10:09:17

> Remove some unnecessary attributes

In [159]:
dim_remove_feature=['film_id','store_id', 'last_update']
df_diminventory.drop(dim_remove_feature, axis=1, inplace=True)

In [160]:
df_diminventory.columns

Index(['title', 'description', 'release_year', 'language', 'rental_duration',
       'rental_rate', 'length', 'replacement_cost', 'rating',
       'special_features', 'catalogy name', 'inventory_id'],
      dtype='object')

In [161]:
df_diminventory.head(5)

,title,description,release_year,language,rental_duration,rental_rate,length,replacement_cost,rating,special_features,catalogy name,inventory_id
0,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,1
1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,2
2,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,3
3,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,4
4,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,5

> format the attribute order

In [162]:
df_diminventory=df_diminventory[['inventory_id','title', 'description', 'release_year', 'language', 'rental_duration',
       'rental_rate', 'length', 'replacement_cost', 'rating',
       'special_features', 'catalogy name']]

In [163]:
df_diminventory.columns

Index(['inventory_id', 'title', 'description', 'release_year', 'language',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'catalogy name'],
      dtype='object')

In [164]:
df_diminventory.shape

(4581, 12)

>Dump dimensions Inventory to csv files

In [165]:
df_diminventory.to_csv('./dimInventory.csv', index_label='inventory_key')

### 3.4.Create data fact_inventory_analysis.csv

> Read data of dimension files

In [166]:
# Đọc dữ liệu từ các tệp CSV vào DataFrame
df_inventory = pd.read_csv("DimInventory.csv")
df_rental = pd.read_csv("DimRental.csv")
df_date = pd.read_csv("DimDate.csv")

> Calculate measure

> Calculate  the number of films remaining in stock

In [167]:
merged_df = df_inventory.merge(df_rental, on='inventory_id', how='left')

In [168]:
# Group by inventory_id and count the number of rentals for each item
rental_counts = merged_df.groupby('inventory_id')['rental_key'].count().reset_index(name='rental_count')

In [169]:
df_remaining = df_inventory.merge(rental_counts, on='inventory_id', how='left')

In [170]:
# Calculate the remaining quantity of each inventory item
df_remaining['remaining'] = df_inventory['inventory_id'].count() - df_remaining['rental_count']

In [171]:
df_remaining.head(5)

,inventory_key,inventory_id,title,description,release_year,language,rental_duration,rental_rate,length,replacement_cost,rating,special_features,catalogy name,rental_count,remaining
0,0,1,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,3,4578
1,1,2,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,5,4576
2,2,3,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,2,4579
3,3,4,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,2,4579
4,4,5,ACADEMY DINOSAUR,An Epic Drama of a Feminist And a Mad Scientis...,2006.0,English,6,0.99,86.0,20.99,PG,"{""Deleted Scenes"",""Behind the Scenes""}",Documentary,0,4581

> Calculate Total Rental Amount

In [172]:
total_rental_amount_df = df_rental.groupby('inventory_id')['amount'].sum().reset_index(name='Total_Rental_Amount')

In [173]:
total_rental_amount_df .head(5)

   inventory_id  Total_Rental_Amount
0             1                 8.97
1             2                 7.95
2             3                 1.98
3             4                 1.98
4             6                 8.95

In [174]:
df_rental_temp=pd.merge(total_rental_amount_df ,df_rental,on='inventory_id',how='inner')

In [175]:
df_rental_temp.columns

Index(['inventory_id', 'Total_Rental_Amount', 'rental_key', 'rental_id',
       'rental_date', 'return_date', 'staff_id', 'payment_id', 'amount',
       'payment_date'],
      dtype='object')

In [176]:
df_rental_temp[['rental_key','Total_Rental_Amount']].head(5)

   rental_key  Total_Rental_Amount
0        4860                 8.97
1       11428                 8.97
2       14709                 8.97
3         970                 7.95
4        2115                 7.95

In [177]:
fact_inventory_analysis_df = pd.merge(df_remaining, df_rental_temp,on='inventory_id' , how='inner')
fact_inventory_analysis_df['orderdate_key']=df_DimDate['orderdate_key']

In [178]:
fact_inventory_analysis_df.columns

Index(['inventory_key', 'inventory_id', 'title', 'description', 'release_year',
       'language', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'catalogy name',
       'rental_count', 'remaining', 'Total_Rental_Amount', 'rental_key',
       'rental_id', 'rental_date', 'return_date', 'staff_id', 'payment_id',
       'amount', 'payment_date', 'orderdate_key'],
      dtype='object')

In [179]:
fact_inventory_analysis_df = fact_inventory_analysis_df[['inventory_key', 'rental_key', 'orderdate_key', 'remaining', 'Total_Rental_Amount']]

> dump fact_inventory_analysis_df to csv

In [180]:
fact_inventory_analysis_df.to_csv('./Fact_Inventory_Analysis.csv', index=False)